carbon-language/carbon-lang/llvm/lib/Target/PIC16/PIC16ISelLowering.cpp
       // Label for argument passing
       const char *argFrame = ESNames::createESName(PAN::getArgsLabel(Name));
       ArgLabel = DAG.getTargetExternalSymbol(argFrame, MVT::i8);

       // Label for reading return value
       const char *retName = ESNames::createESName(PAN::getRetvalLabel(Name));
       RetLabel = DAG.getTargetExternalSymbol(retName, MVT::i8);
    } else {
       // if indirect call
       SDValue CodeAddr_Lo = Callee.getOperand(0);
       SDValue CodeAddr_Hi = Callee.getOperand(1);

       /*CodeAddr_Lo = DAG.getNode(ISD::ADD, dl, MVT::i8, CodeAddr_Lo,
                                 DAG.getConstant(2, MVT::i8));*/

       // move Hi part in PCLATH
       CodeAddr_Hi = DAG.getNode(PIC16ISD::MTPCLATH, dl, MVT::i8, CodeAddr_Hi);
       Callee = DAG.getNode(PIC16ISD::PIC16Connect, dl, MVT::i8, CodeAddr_Lo,
                            CodeAddr_Hi);
    } 

    // Pass the argument to function before making the call.
    SDValue CallArgs;
    if (IsDirectCall) {
      CallArgs = LowerDirectCallArguments(ArgLabel, Chain, OperFlag,
                                          Outs, dl, DAG);
      Chain = getChain(CallArgs);
      OperFlag = getOutFlag(CallArgs);
    } else {
      CallArgs = LowerIndirectCallArguments(Chain, OperFlag, DataAddr_Lo,
                                            DataAddr_Hi, Outs, Ins, dl, DAG);
      Chain = getChain(CallArgs);
      OperFlag = getOutFlag(CallArgs);
    }

    SDVTList Tys = DAG.getVTList(MVT::Other, MVT::Flag);
    SDValue PICCall = DAG.getNode(PIC16ISD::CALL, dl, Tys, Chain, Callee,
                                  OperFlag);
    Chain = getChain(PICCall);
    OperFlag = getOutFlag(PICCall);


    // Carrying the Constant 0 along the CALLSEQSTART
    // because there is nothing else to carry.
    SDValue SeqEnd = DAG.getCALLSEQ_END(Chain, ZeroOperand, ZeroOperand,
                                        OperFlag);
    Chain = getChain(SeqEnd);
    OperFlag = getOutFlag(SeqEnd);

    // Lower the return value reading after the call.
    if (IsDirectCall)
      return LowerDirectCallReturn(RetLabel, Chain, OperFlag,
                                   Ins, dl, DAG, InVals);
    else
      return LowerIndirectCallReturn(Chain, OperFlag, DataAddr_Lo,
                                     DataAddr_Hi, Ins, dl, DAG, InVals);
}

bool PIC16TargetLowering::isDirectLoad(const SDValue Op) const {
  if (Op.getOpcode() == PIC16ISD::PIC16Load)
    if (Op.getOperand(1).getOpcode() == ISD::TargetGlobalAddress
     || Op.getOperand(1).getOpcode() == ISD::TargetExternalSymbol)
      return true;
  return false;
}

// NeedToConvertToMemOp - Returns true if one of the operands of the
// operation 'Op' needs to be put into memory. Also returns the
// operand no. of the operand to be converted in 'MemOp'. Remember, PIC16 has 
// no instruction that can operation on two registers. Most insns take
// one register and one memory operand (addwf) / Constant (addlw).
bool PIC16TargetLowering::NeedToConvertToMemOp(SDValue Op, unsigned &MemOp, 
                      SelectionDAG &DAG) const {
  // If one of the operand is a constant, return false.
  if (Op.getOperand(0).getOpcode() == ISD::Constant ||
      Op.getOperand(1).getOpcode() == ISD::Constant)
    return false;    

  // Return false if one of the operands is already a direct
  // load and that operand has only one use.
  if (isDirectLoad(Op.getOperand(0))) {
    if (Op.getOperand(0).hasOneUse()) {  
      // Legal and profitable folding check uses the NodeId of DAG nodes.
      // This NodeId is assigned by topological order. Therefore first 
      // assign topological order then perform legal and profitable check.
      // Note:- Though this ordering is done before begining with legalization,
      // newly added node during legalization process have NodeId=-1 (NewNode)
      // therefore before performing any check proper ordering of the node is
      // required.
      DAG.AssignTopologicalOrder();

      // Direct load operands are folded in binary operations. But before folding
      // verify if this folding is legal. Fold only if it is legal otherwise
      // convert this direct load to a separate memory operation.
      if (SelectionDAGISel::IsLegalToFold(Op.getOperand(0),
                                          Op.getNode(), Op.getNode(),
                                          CodeGenOpt::Default))
        return false;
      else 
        MemOp = 0;
    }
  }

  // For operations that are non-cummutative there is no need to check 
  // for right operand because folding right operand may result in 
  // incorrect operation. 
  if (! SelectionDAG::isCommutativeBinOp(Op.getOpcode()))
    return true;

  if (isDirectLoad(Op.getOperand(1))) {
    if (Op.getOperand(1).hasOneUse()) {
      // Legal and profitable folding check uses the NodeId of DAG nodes.
      // This NodeId is assigned by topological order. Therefore first 
      // assign topological order then perform legal and profitable check.
      // Note:- Though this ordering is done before begining with legalization,
      // newly added node during legalization process have NodeId=-1 (NewNode)
      // therefore before performing any check proper ordering of the node is
      // required.
      DAG.AssignTopologicalOrder();

      // Direct load operands are folded in binary operations. But before folding
      // verify if this folding is legal. Fold only if it is legal otherwise
      // convert this direct load to a separate memory operation.
      if (SelectionDAGISel::IsLegalToFold(Op.getOperand(1),
                                          Op.getNode(), Op.getNode(),
                                          CodeGenOpt::Default))
         return false;
      else 
         MemOp = 1; 
    }
  }
  return true;
}  

// LowerBinOp - Lower a commutative binary operation that does not
// affect status flag carry.
SDValue PIC16TargetLowering::LowerBinOp(SDValue Op, SelectionDAG &DAG) const {
  DebugLoc dl = Op.getDebugLoc();

  // We should have handled larger operands in type legalizer itself.
  assert (Op.getValueType() == MVT::i8 && "illegal Op to lower");

  unsigned MemOp = 1;
  if (NeedToConvertToMemOp(Op, MemOp, DAG)) {
    // Put one value on stack.
    SDValue NewVal = ConvertToMemOperand (Op.getOperand(MemOp), DAG, dl);

    return DAG.getNode(Op.getOpcode(), dl, MVT::i8, Op.getOperand(MemOp ^ 1),
    NewVal);
  }
  else {
    return Op;
  }
}

